{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "025ffdae-d7a2-4388-ae4a-5af0278e84e6",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Import packages\n",
    "from rdflib import Graph\n",
    "import pandas as pd\n",
    "from IPython.display import display, HTML"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "c353ffb0-6061-4d07-bacf-ef1184471f10",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Graph has 3966 triples.\n"
     ]
    }
   ],
   "source": [
    "# Load the Star Wars data\n",
    "g = Graph()\n",
    "g.parse(\"data.ttl\", format=\"turtle\")\n",
    "print(f\"Graph has {len(g)} triples.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "14ab1d5e-7fa1-4165-8b62-bd9972fe0548",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define function to present query results\n",
    "def render_sparql_html(result, query_type=\"SELECT\"):\n",
    "    \"\"\"\n",
    "    Renders SPARQL query results as an HTML table.\n",
    "    \n",
    "    Parameters:\n",
    "    - result: the output of g.query(...)\n",
    "    - query_type: one of \"SELECT\", \"CONSTRUCT\", \"DESCRIBE\"\n",
    "    \"\"\"\n",
    "    html = \"<table><tr>\"\n",
    "\n",
    "    if query_type.upper() == \"SELECT\":\n",
    "        headers = result.vars\n",
    "        html += \"\".join(f\"<th>{h}</th>\" for h in headers) + \"</tr>\"\n",
    "        for row in result:\n",
    "            html += \"<tr>\" + \"\".join(f\"<td>{row.get(h, '')}</td>\" for h in headers) + \"</tr>\"\n",
    "\n",
    "    elif query_type.upper() in [\"CONSTRUCT\", \"DESCRIBE\"]:\n",
    "        html += \"<th>Subject</th><th>Predicate</th><th>Object</th></tr>\"\n",
    "        for s, p, o in result:\n",
    "            html += f\"<tr><td>{s}</td><td>{p}</td><td>{o}</td></tr>\"\n",
    "\n",
    "    else:\n",
    "        raise ValueError(\"Unsupported query type. Use SELECT, CONSTRUCT, or DESCRIBE.\")\n",
    "\n",
    "    html += \"</table>\"\n",
    "    display(HTML(html))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2ccdb122-d9af-4281-b330-0a6301cbe4a5",
   "metadata": {},
   "source": [
    "# Exercise 1: What does this query do?\n",
    "\n",
    "- Change the order of ?s ?p ?o\n",
    "- Play around with `LIMIT`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "id": "1ad89f39-f442-41a6-aed2-b98067052c75",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>s</th><th>p</th><th>o</th></tr><tr><td>https://swapi.co/resource/starship/21</td><td>https://swapi.co/vocabulary/pilot</td><td>https://swapi.co/resource/human/22</td></tr><tr><td>https://swapi.co/vocabulary/Skakoan</td><td>https://swapi.co/vocabulary/film</td><td>https://swapi.co/resource/film/5</td></tr><tr><td>https://swapi.co/resource/film/7</td><td>https://swapi.co/vocabulary/character</td><td>https://swapi.co/resource/human/14</td></tr><tr><td>https://swapi.co/resource/starship/58</td><td>https://swapi.co/vocabulary/hyperdriveRating</td><td>1.5</td></tr><tr><td>https://swapi.co/resource/zabrak/54</td><td>https://swapi.co/vocabulary/homeworld</td><td>https://swapi.co/resource/planet/45</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Exercise 1\n",
    "query = \"\"\"\n",
    "\n",
    "SELECT ?s ?p ?o\n",
    "WHERE {\n",
    "  ?s ?p ?o .\n",
    "}\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "results = g.query(query)\n",
    "render_sparql_html(results, query_type=\"SELECT\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cc9e551b-0cd0-4821-b230-6faf0a9aab28",
   "metadata": {},
   "source": [
    "# Exercise 2: Add a prefix"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "9d49ce09-a8e7-4c49-a18d-490fe622c33d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>human</th></tr><tr><td>https://swapi.co/resource/human/42</td></tr><tr><td>https://swapi.co/resource/human/88</td></tr><tr><td>https://swapi.co/resource/human/26</td></tr><tr><td>https://swapi.co/resource/human/28</td></tr><tr><td>https://swapi.co/resource/human/34</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "# Add prefix here\n",
    "PREFIX voc: <replace-this-with-uri>\n",
    "\n",
    "SELECT *\n",
    "WHERE {\n",
    "  ?human a voc:Human .\n",
    "}\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "results = g.query(query)\n",
    "render_sparql_html(results, query_type=\"SELECT\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "b1879537-eacf-4ff0-8654-8f3cdb843ec0",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>Subject</th><th>Predicate</th><th>Object</th></tr><tr><td>https://swapi.co/resource/human/28</td><td>https://swapi.co/vocabulary/eyeColor</td><td>blue</td></tr><tr><td>https://swapi.co/resource/human/28</td><td>https://swapi.co/vocabulary/film</td><td>https://swapi.co/resource/film/3</td></tr><tr><td>https://swapi.co/resource/human/28</td><td>https://swapi.co/vocabulary/gender</td><td>female</td></tr><tr><td>https://swapi.co/resource/human/28</td><td>https://swapi.co/vocabulary/birthYear</td><td>48BBY</td></tr><tr><td>https://swapi.co/resource/human/28</td><td>https://swapi.co/vocabulary/hairColor</td><td>auburn</td></tr><tr><td>https://swapi.co/resource/human/28</td><td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td><td>https://swapi.co/vocabulary/Human</td></tr><tr><td>https://swapi.co/resource/human/28</td><td>http://www.w3.org/2000/01/rdf-schema#label</td><td>Mon Mothma</td></tr><tr><td>https://swapi.co/resource/human/28</td><td>https://swapi.co/vocabulary/homeworld</td><td>https://swapi.co/resource/planet/32</td></tr><tr><td>https://swapi.co/resource/human/28</td><td>https://swapi.co/vocabulary/skinColor</td><td>fair</td></tr><tr><td>https://swapi.co/resource/human/28</td><td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td><td>https://swapi.co/vocabulary/Character</td></tr><tr><td>https://swapi.co/resource/human/28</td><td>https://swapi.co/vocabulary/height</td><td>150.0</td></tr><tr><td>https://swapi.co/resource/human/28</td><td>https://swapi.co/vocabulary/desc</td><td>None</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "PREFIX voc: <https://swapi.co/vocabulary/> \n",
    "\n",
    "DESCRIBE <https://swapi.co/resource/human/28>\n",
    "\"\"\"\n",
    "\n",
    "results = g.query(query)\n",
    "render_sparql_html(results, query_type=\"DESCRIBE\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5c3174b3-38e5-4b3b-a6dd-dae3c37fb9b2",
   "metadata": {},
   "source": [
    "# Exercise 3: Which humans are in this dataset?\n",
    "\n",
    "- According to the description on the website, the dataset contains the following classes: `voc:Character, voc:Human, voc:Film, voc:Planet, voc:Starship, voc:Species, voc:Vehicle`.\n",
    "- You can find their names using `rdfs:label`\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c14a6c95-ebcc-4915-b879-c9f1c1c4c677",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Exercise 3\n",
    "query = \"\"\"\n",
    "\n",
    "PREFIX voc: <https://swapi.co/vocabulary/> \n",
    "\n",
    "SELECT ?s ?p ?o\n",
    "WHERE {\n",
    "  ?s ?p ?o .\n",
    "}\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "results = g.query(query)\n",
    "render_sparql_html(results, query_type=\"SELECT\")\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "id": "ed5ef073-7244-4b82-bb70-eed404976523",
   "metadata": {},
   "source": [
    "# Exercise 4: Which information does an instance of a certain class appear to have?\n",
    "\n",
    "- Select a resource that you want to explore further.\n",
    "- Use the DESCRIBE query."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "99f78e50-b50d-4fa1-b672-b36797069d08",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>Subject</th><th>Predicate</th><th>Object</th></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Exercise 4\n",
    "query = \"\"\"\n",
    "PREFIX voc: <https://swapi.co/vocabulary/> \n",
    "\n",
    "DESCRIBE <replace-with-uri>\n",
    "\"\"\"\n",
    "\n",
    "results = g.query(query)\n",
    "render_sparql_html(results, query_type=\"DESCRIBE\")\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "id": "0a304a40-3ef0-4807-95f2-e4fbfbdc0337",
   "metadata": {},
   "source": [
    "# Exercise 5: Which films featured Obi-Wan Kenobi?\n",
    "\n",
    "- Remember/copy the URI for Obi-Wan Kenobi\n",
    "- Determine how you will discover what the relationship is between a Human and a Film\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "395c7022-1f9b-4607-ab88-52fb114cc381",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Exercise 5\n",
    "query = \"\"\"\n",
    "PREFIX voc: <https://swapi.co/vocabulary/> \n",
    "\n",
    "\"\"\"\n",
    "\n",
    "results = g.query(query)\n",
    "render_sparql_html(results, query_type=\"SELECT\")\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "id": "802935b9-29d7-4459-ba47-c363dcfecdb4",
   "metadata": {},
   "source": [
    "# Exercise 6: Get the population number of planets in descending order and the movies in which they featured\n",
    "\n",
    "- Find the attribute for the population number for a Planet\n",
    "- Determine how you will find out what the relationship is between a Planet and a Film\n",
    "- If you don’t want to show everything, then only put the variables for the labels in the SELECT clause\n",
    "- Use ORDER BY DESC to sort the results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "75bf50e1-b22f-4382-802c-b179a65f048a",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Exercise 6\n",
    "query = \"\"\"\n",
    "PREFIX voc: <https://swapi.co/vocabulary/> \n",
    "\n",
    "\"\"\"\n",
    "\n",
    "results = g.query(query)\n",
    "render_sparql_html(results, query_type=\"SELECT\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ab40faeb-1fe6-42b3-bc72-56d7f9aaff6b",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "32d8e504-b401-469b-9102-1c40b95612a4",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "803b93c9-e933-4bea-87d4-bb204a125820",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "47fe3bd0-c813-40f5-b545-7beb10a36c17",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e1769f6e-192f-4b2a-936e-61a0eb892317",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "57389043-dd7a-47b9-93e7-490d25d11508",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7f8cbeaf-5005-4045-a01a-db7c611ae6d4",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "dbd518e8-fe0a-4131-9133-e300eb5c2123",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "08ed11dc-43ea-4ffb-a1f0-9e7b7c347f9e",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "07dc9afa-7f5f-4502-9d44-5cc0ed39116d",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "355e03a1-a711-46b4-858d-2b0f93d98bb8",
   "metadata": {},
   "source": [
    "# Answers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "id": "90f1c042-d8e1-4c33-b1ef-ce5b53721732",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>s</th><th>p</th><th>o</th></tr><tr><td>https://swapi.co/resource/starship/21</td><td>https://swapi.co/vocabulary/pilot</td><td>https://swapi.co/resource/human/22</td></tr><tr><td>https://swapi.co/vocabulary/Skakoan</td><td>https://swapi.co/vocabulary/film</td><td>https://swapi.co/resource/film/5</td></tr><tr><td>https://swapi.co/resource/film/7</td><td>https://swapi.co/vocabulary/character</td><td>https://swapi.co/resource/human/14</td></tr><tr><td>https://swapi.co/resource/starship/58</td><td>https://swapi.co/vocabulary/hyperdriveRating</td><td>1.5</td></tr><tr><td>https://swapi.co/resource/zabrak/54</td><td>https://swapi.co/vocabulary/homeworld</td><td>https://swapi.co/resource/planet/45</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Answer Exercise 1\n",
    "query = \"\"\"\n",
    "\n",
    "SELECT ?s ?p ?o\n",
    "WHERE {\n",
    "  ?s ?p ?o .\n",
    "}\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "results = g.query(query)\n",
    "render_sparql_html(results, query_type=\"SELECT\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "id": "d28ed348-1a1e-4353-b210-156790445cc0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>human</th></tr><tr><td>https://swapi.co/resource/human/42</td></tr><tr><td>https://swapi.co/resource/human/88</td></tr><tr><td>https://swapi.co/resource/human/26</td></tr><tr><td>https://swapi.co/resource/human/28</td></tr><tr><td>https://swapi.co/resource/human/34</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Answer Exercise 2\n",
    "query = \"\"\"\n",
    "\n",
    "# Add prefix here\n",
    "PREFIX voc: <https://swapi.co/vocabulary/> \n",
    "\n",
    "SELECT *\n",
    "WHERE {\n",
    "  ?human a voc:Human .\n",
    "}\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "results = g.query(query)\n",
    "render_sparql_html(results, query_type=\"SELECT\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "76253bab-776d-44b1-b02b-073a52c1c9c5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>human</th><th>label</th></tr><tr><td>https://swapi.co/resource/human/42</td><td>Quarsh Panaka</td></tr><tr><td>https://swapi.co/resource/human/88</td><td>Captain Phasma</td></tr><tr><td>https://swapi.co/resource/human/26</td><td>Lobot</td></tr><tr><td>https://swapi.co/resource/human/28</td><td>Mon Mothma</td></tr><tr><td>https://swapi.co/resource/human/34</td><td>Finis Valorum</td></tr><tr><td>https://swapi.co/resource/human/39</td><td>Ric Olié</td></tr><tr><td>https://swapi.co/resource/human/61</td><td>Cordé</td></tr><tr><td>https://swapi.co/resource/human/62</td><td>Cliegg Lars</td></tr><tr><td>https://swapi.co/resource/human/66</td><td>Dormé</td></tr><tr><td>https://swapi.co/resource/human/69</td><td>Jango Fett</td></tr><tr><td>https://swapi.co/resource/human/74</td><td>Jocasta Nu</td></tr><tr><td>https://swapi.co/resource/human/84</td><td>Finn</td></tr><tr><td>https://swapi.co/resource/human/85</td><td>Rey</td></tr><tr><td>https://swapi.co/resource/human/12</td><td>Wilhuff Tarkin</td></tr><tr><td>https://swapi.co/resource/human/19</td><td>Jek Tono Porkins</td></tr><tr><td>https://swapi.co/resource/human/29</td><td>Arvel Crynyd</td></tr><tr><td>https://swapi.co/resource/human/32</td><td>Qui-Gon Jinn</td></tr><tr><td>https://swapi.co/resource/human/43</td><td>Shmi Skywalker</td></tr><tr><td>https://swapi.co/resource/human/60</td><td>Gregar Typho</td></tr><tr><td>https://swapi.co/resource/human/68</td><td>Bail Prestor Organa</td></tr><tr><td>https://swapi.co/resource/human/81</td><td>Raymus Antilles</td></tr><tr><td>https://swapi.co/resource/human/86</td><td>Poe Dameron</td></tr><tr><td>https://swapi.co/resource/human/9</td><td>Biggs Darklighter</td></tr><tr><td>https://swapi.co/resource/human/25</td><td>Lando Calrissian</td></tr><tr><td>https://swapi.co/resource/human/51</td><td>Mace Windu</td></tr><tr><td>https://swapi.co/resource/human/6</td><td>Owen Lars</td></tr><tr><td>https://swapi.co/resource/human/67</td><td>Dooku</td></tr><tr><td>https://swapi.co/resource/human/7</td><td>Beru Whitesun lars</td></tr><tr><td>https://swapi.co/resource/human/22</td><td>Boba Fett</td></tr><tr><td>https://swapi.co/resource/human/18</td><td>Wedge Antilles</td></tr><tr><td>https://swapi.co/resource/human/21</td><td>Palpatine</td></tr><tr><td>https://swapi.co/resource/human/4</td><td>Darth Vader</td></tr><tr><td>https://swapi.co/resource/human/14</td><td>Han Solo</td></tr><tr><td>https://swapi.co/resource/human/35</td><td>Padmé Amidala</td></tr><tr><td>https://swapi.co/resource/human/5</td><td>Leia Organa</td></tr><tr><td>https://swapi.co/resource/human/11</td><td>Anakin Skywalker</td></tr><tr><td>https://swapi.co/resource/human/1</td><td>Luke Skywalker</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>Obi-Wan Kenobi</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Answer Exercise 3\n",
    "query = \"\"\"\n",
    "PREFIX voc: <https://swapi.co/vocabulary/> \n",
    "\n",
    "SELECT ?human ?label\n",
    "WHERE {\n",
    "    ?human rdf:type voc:Human .\n",
    "    ?human rdfs:label ?label .\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "results = g.query(query)\n",
    "render_sparql_html(results, query_type=\"SELECT\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "b09b78f6-c5f7-44bf-b831-e472fa53a9fe",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>Subject</th><th>Predicate</th><th>Object</th></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/desc</td><td>Obi-Wan \"Ben\" Kenobi is a fictional character in the Star Wars franchise. Within the original trilogy he is portrayed by Sir Alec Guinness, while in the prequel trilogy a younger version of the character is portrayed by Ewan McGregor. In the original trilogy, he is a mentor to Luke Skywalker, to whom he introduces the ways of the Jedi. In the prequel trilogy, he is a master and friend to Anakin Skywalker. He is frequently featured as a main character in various other Star Wars media., \"Sir Alec Guinnesss portrayal of Obi-Wan in the original Star Wars (1977) remains the only time an actor has received an Oscar nomination (Best Supporting Actor) for acting in a Star Wars film.\"</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/film</td><td>https://swapi.co/resource/film/4</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/eyeColor</td><td>blue-gray</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/vehicle</td><td>https://swapi.co/resource/vehicle/38</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/starship</td><td>https://swapi.co/resource/starship/59</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/homeworld</td><td>https://swapi.co/resource/planet/20</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/film</td><td>https://swapi.co/resource/film/1</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>http://www.w3.org/2000/01/rdf-schema#label</td><td>Obi-Wan Kenobi</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/skinColor</td><td>fair</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/birthYear</td><td>57BBY</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/starship</td><td>https://swapi.co/resource/starship/48</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/film</td><td>https://swapi.co/resource/film/5</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/starship</td><td>https://swapi.co/resource/starship/64</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/mass</td><td>77.0</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/height</td><td>182.0</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/starship</td><td>https://swapi.co/resource/starship/74</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/starship</td><td>https://swapi.co/resource/starship/65</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/hairColor</td><td>auburn, white</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td><td>https://swapi.co/vocabulary/Human</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/gender</td><td>male</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/film</td><td>https://swapi.co/resource/film/6</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/film</td><td>https://swapi.co/resource/film/2</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td><td>https://swapi.co/vocabulary/Character</td></tr><tr><td>https://swapi.co/resource/human/10</td><td>https://swapi.co/vocabulary/film</td><td>https://swapi.co/resource/film/3</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Answer Exercise 4\n",
    "query = \"\"\"\n",
    "PREFIX voc: <https://swapi.co/vocabulary/> \n",
    "\n",
    "DESCRIBE <https://swapi.co/resource/human/10>\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "results = g.query(query)\n",
    "render_sparql_html(results, query_type=\"DESCRIBE\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "09252366-2247-473a-a7f7-e16b20846500",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>film</th><th>filmLabel</th></tr><tr><td>https://swapi.co/resource/film/1</td><td>A New Hope</td></tr><tr><td>https://swapi.co/resource/film/2</td><td>The Empire Strikes Back</td></tr><tr><td>https://swapi.co/resource/film/3</td><td>Return of the Jedi</td></tr><tr><td>https://swapi.co/resource/film/4</td><td>The Phantom Menace</td></tr><tr><td>https://swapi.co/resource/film/5</td><td>Attack of the Clones</td></tr><tr><td>https://swapi.co/resource/film/6</td><td>Revenge of the Sith</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Answer Exercise 5\n",
    "query = \"\"\"\n",
    "PREFIX voc: <https://swapi.co/vocabulary/> \n",
    "\n",
    "SELECT *\n",
    "WHERE {\n",
    "    <https://swapi.co/resource/human/10> voc:film ?film .\n",
    "    ?film rdfs:label ?filmLabel .\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "results = g.query(query)\n",
    "render_sparql_html(results, query_type=\"SELECT\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "6ec4119c-12b3-4385-bc2b-a16f3c9cd1bf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>planetLabel</th><th>population</th><th>filmLabel</th></tr><tr><td>Coruscant</td><td>1000000000000</td><td>Return of the Jedi</td></tr><tr><td>Coruscant</td><td>1000000000000</td><td>The Phantom Menace</td></tr><tr><td>Coruscant</td><td>1000000000000</td><td>Attack of the Clones</td></tr><tr><td>Coruscant</td><td>1000000000000</td><td>Revenge of the Sith</td></tr><tr><td>Geonosis</td><td>100000000000</td><td>Attack of the Clones</td></tr><tr><td>Naboo</td><td>4500000000</td><td>Return of the Jedi</td></tr><tr><td>Naboo</td><td>4500000000</td><td>The Phantom Menace</td></tr><tr><td>Naboo</td><td>4500000000</td><td>Attack of the Clones</td></tr><tr><td>Naboo</td><td>4500000000</td><td>Revenge of the Sith</td></tr><tr><td>Ord Mantell</td><td>4000000000</td><td>The Empire Strikes Back</td></tr><tr><td>Alderaan</td><td>2000000000</td><td>A New Hope</td></tr><tr><td>Alderaan</td><td>2000000000</td><td>Revenge of the Sith</td></tr><tr><td>Saleucami</td><td>1400000000</td><td>Revenge of the Sith</td></tr><tr><td>Kamino</td><td>1000000000</td><td>Attack of the Clones</td></tr><tr><td>Utapau</td><td>95000000</td><td>Revenge of the Sith</td></tr><tr><td>Kashyyyk</td><td>45000000</td><td>Revenge of the Sith</td></tr><tr><td>Endor</td><td>30000000</td><td>Return of the Jedi</td></tr><tr><td>Mygeeto</td><td>19000000</td><td>Revenge of the Sith</td></tr><tr><td>Cato Neimoidia</td><td>10000000</td><td>Revenge of the Sith</td></tr><tr><td>Felucia</td><td>8500000</td><td>Revenge of the Sith</td></tr><tr><td>Bespin</td><td>6000000</td><td>The Empire Strikes Back</td></tr><tr><td>Polis Massa</td><td>1000000</td><td>Revenge of the Sith</td></tr><tr><td>Tatooine</td><td>200000</td><td>A New Hope</td></tr><tr><td>Tatooine</td><td>200000</td><td>Return of the Jedi</td></tr><tr><td>Tatooine</td><td>200000</td><td>The Phantom Menace</td></tr><tr><td>Tatooine</td><td>200000</td><td>Attack of the Clones</td></tr><tr><td>Tatooine</td><td>200000</td><td>Revenge of the Sith</td></tr><tr><td>Mustafar</td><td>20000</td><td>Revenge of the Sith</td></tr><tr><td>Yavin IV</td><td>1000</td><td>A New Hope</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Answer Exercise 6\n",
    "query = \"\"\"\n",
    "PREFIX voc: <https://swapi.co/vocabulary/> \n",
    "\n",
    "SELECT ?planetLabel ?population ?filmLabel\n",
    "WHERE {\n",
    "    ?planet a voc:Planet ;\n",
    "        voc:population ?population ;\n",
    "        voc:film ?film .\n",
    "    ?planet rdfs:label ?planetLabel .\n",
    "    ?film rdfs:label ?filmLabel .\n",
    "}\n",
    "ORDER BY DESC(?population)\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "results = g.query(query)\n",
    "render_sparql_html(results, query_type=\"SELECT\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b1f6feff-af6b-4126-8b46-00d33656351a",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
